Revit 2026 API
LightType.SetInitialIntensity Method
 Replace the current initial intensity object with the given object
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public void SetInitialIntensity(
	InitialIntensity initialIntensity
)
Public Sub SetInitialIntensity (
	initialIntensity As InitialIntensity
)
public:
void SetInitialIntensity(
	InitialIntensity^ initialIntensity
)
member SetInitialIntensity :
        initialIntensity : InitialIntensity -> unit
Parameters
initialIntensity InitialIntensity
 An object derived from an InitialIntensity object
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 The argument object is cloned
See Also
Reference
LightType Class
Autodesk.Revit.DB.Lighting Namespace